# More SQL

Start by downloading a MySQL and SQLite client for your computer:
- MySQL
  - MySQL Workbench
    - all operating systems
    - https://dev.mysql.com/downloads/workbench/
  - Sequel Pro
    - Mac only
    - https://sequelpro.com/download
- SQLite
  - DB Browser for SQLite
  - https://sqlitebrowser.org/dl/

We're working with the [Chinook data set](https://archive.codeplex.com/?p=chinookdatabase) today.  Some database files are in the `/data` folder here.

### Different relational DBs:
https://en.wikipedia.org/wiki/Comparison_of_relational_database_management_systems

In [1]:
!ls data/

sourceCode\chinookdatabase\ChinookDatabase\DataSources\Chinook_MySql.sql
sourceCode\chinookdatabase\ChinookDatabase\DataSources\Chinook_Sqlite.sql
sourceCode\chinookdatabase\ChinookDatabase\DataSources\Chinook_Sqlite.sqlite

## Connect to MySQL
I have a MySQL instance running in the cloud right now.  Connect to it with the following parameters:
- __Connection Name__: Whatever you want (`flatiron-demo`?)
- __Connection Method__: TCP/IP
- __Hostname__: `demo1.c1doesqrid0e.us-east-1.rds.amazonaws.com`
- __Port__: `3306` (leave default)
- __Username__: `flatiron`
- __Password__: will give in class or over Slack

Note: As is, this will only work from our current location (by IP address)!

You can also connect using Terminal:
```bash
mysql -h demo1.c1doesqrid0e.us-east-1.rds.amazonaws.com -u flatiron -p
```

## Data Exploration
Most of today is just going to be exploring and answering questions about our data.  We'll first do this in the client, and then move our answers into Python.  The questions we'll be answering are below.

In [7]:
# If you haven't yet already:
!pip install pymysql

Collecting pymysql
  Downloading https://files.pythonhosted.org/packages/ed/39/15045ae46f2a123019aa968dfcba0396c161c20f855f11dea6796bcaae95/PyMySQL-0.9.3-py2.py3-none-any.whl (47kB)
    100% |████████████████████████████████| 51kB 3.3MB/s
Installing collected packages: pymysql
Successfully installed pymysql-0.9.3

In [8]:
import pandas as pd
import pymysql
import sqlite3

In [9]:
host = 'demo1.c1doesqrid0e.us-east-1.rds.amazonaws.com'
port = 3306
user = 'flatiron'
db = 'Chinook'

In [10]:
password = 'SecurePassword1440'

In [11]:
conn_mysql = pymysql.connect(host=host, port=port, user=user, passwd=password, db=db)
conn_sqlite = sqlite3.connect('data/Chinook_Sqlite.sqlite')

In [19]:
# check how money tables there are in the sqlite master table
conn_sqlite.execute("""
SELECT name
FROM sqlite_master
WHERE type = 'table'
""").fetchall()

[('Album',),
 ('Artist',),
 ('Customer',),
 ('Employee',),
 ('Genre',),
 ('Invoice',),
 ('InvoiceLine',),
 ('MediaType',),
 ('Playlist',),
 ('PlaylistTrack',),
 ('Track',)]

In [12]:
pd.read_sql_query('SELECT * FROM Album LIMIT 10;', conn_mysql)

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3
5        6                     Jagged Little Pill         4
6        7                               Facelift         5
7        8                         Warner 25 Anos         6
8        9         Plays Metallica By Four Cellos         7
9       10                             Audioslave         8

In [13]:
pd.read_sql_query('SELECT * FROM Album LIMIT 10;', conn_sqlite)

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3
5        6                     Jagged Little Pill         4
6        7                               Facelift         5
7        8                         Warner 25 Anos         6
8        9         Plays Metallica By Four Cellos         7
9       10                             Audioslave         8

In [15]:
# Provide a query showing a unique/distinct list of billing
# countries from the Invoice table.
pd.read_sql_query("""
SELECT BillingCountry
FROM Chinook.Invoice
GROUP BY 1
LIMIT 10""", conn_mysql)

   BillingCountry
0       Argentina
1       Australia
2         Austria
3         Belgium
4          Brazil
5          Canada
6           Chile
7  Czech Republic
8         Denmark
9         Finland

In [ ]:
# Provide a query that shows the Invoice Total, Customer name, 
# Country and Sale Agent name for all invoices and customers.

In [26]:
# Provide a query only showing the Customers from Brazil.

In [ ]:
# Provide a query showing the Invoices of customers who are from Brazil.
# The resultant table should show the customer's full name, Invoice ID,
# Date of the invoice and billing country.

In [ ]:
# Provide a query that shows the # of invoices per country.

In [ ]:
# Provide a query that shows the Invoice Total, Customer name,
# Country and Sale Agent name for all invoices and customers.

In [21]:
# Provide a query that shows all Invoices but includes the # of
# invoice line items.
pd.read_sql_query("""
select Invoice.*, count(*) AS invoice_line_count
from InvoiceLine
join Invoice using(InvoiceID)
group by Invoice.InvoiceId;
""", conn_sqlite).head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total,invoice_line_count
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98,2
1,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96,4
2,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,None,Belgium,1000,5.94,6
3,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91,9
4,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86,14

In [ ]:
# Provide a query that includes the purchased track name with each
# invoice line item.

In [ ]:
# Provide a query that includes the purchased track name AND artist
# name with each invoice line item.

In [ ]:
# Looking at the InvoiceLine table, provide a query that COUNTs the
# number of line items for each Invoice.

In [ ]:
# Provide a query showing Customers (just their full names, customer ID
# and country) who are not in the US.

In [ ]:
# Provide a query that shows total sales made by each sales agent.

In [ ]:
# Which sales agent made the most in sales in 2009?
# Hint: Use the MAX function on a subquery

In [ ]:
# Provide a query that shows the most purchased track of 2013.

In [ ]:
# Provide a query that shows the top 3 best selling artists.